In [1]:
import pandas as pd

In [3]:
dictionary_name = {
    'town':['Dhaka','Dhaka','Dhaka','Dhaka','Dhaka','Khulna','Khulna','Khulna','Khulna','Chittagong','Chittagong','Chittagong','Chittagong'],
    'area':[2600,3000,3200,3600,4000,2600,2800,3300,3600,2600,2900,3100,3600],
    'price':[550000,565000,610000,680000,725000,585000,615000,650000,710000,575000,600000,620000,695000]
}
df=pd.DataFrame(dictionary_name) 
df

          town  area   price
0        Dhaka  2600  550000
1        Dhaka  3000  565000
2        Dhaka  3200  610000
3        Dhaka  3600  680000
4        Dhaka  4000  725000
5       Khulna  2600  585000
6       Khulna  2800  615000
7       Khulna  3300  650000
8       Khulna  3600  710000
9   Chittagong  2600  575000
10  Chittagong  2900  600000
11  Chittagong  3100  620000
12  Chittagong  3600  695000

In [6]:
dummies=pd.get_dummies(df.town)
print(dummies)

    Chittagong  Dhaka  Khulna
0            0      1       0
1            0      1       0
2            0      1       0
3            0      1       0
4            0      1       0
5            0      0       1
6            0      0       1
7            0      0       1
8            0      0       1
9            1      0       0
10           1      0       0
11           1      0       0
12           1      0       0

In [8]:
new_df=pd.concat([df,dummies],axis='columns')
new_df

          town  area   price  Chittagong  Dhaka  Khulna
0        Dhaka  2600  550000           0      1       0
1        Dhaka  3000  565000           0      1       0
2        Dhaka  3200  610000           0      1       0
3        Dhaka  3600  680000           0      1       0
4        Dhaka  4000  725000           0      1       0
5       Khulna  2600  585000           0      0       1
6       Khulna  2800  615000           0      0       1
7       Khulna  3300  650000           0      0       1
8       Khulna  3600  710000           0      0       1
9   Chittagong  2600  575000           1      0       0
10  Chittagong  2900  600000           1      0       0
11  Chittagong  3100  620000           1      0       0
12  Chittagong  3600  695000           1      0       0

In [10]:
final=new_df.drop(['town','Khulna'],axis='columns')
final

    area   price  Chittagong  Dhaka
0   2600  550000           0      1
1   3000  565000           0      1
2   3200  610000           0      1
3   3600  680000           0      1
4   4000  725000           0      1
5   2600  585000           0      0
6   2800  615000           0      0
7   3300  650000           0      0
8   3600  710000           0      0
9   2600  575000           1      0
10  2900  600000           1      0
11  3100  620000           1      0
12  3600  695000           1      0

In [11]:
from sklearn.linear_model import LinearRegression
model=LinearRegression()

In [13]:
x=final.drop(['price'],axis='columns')
x

    area  Chittagong  Dhaka
0   2600           0      1
1   3000           0      1
2   3200           0      1
3   3600           0      1
4   4000           0      1
5   2600           0      0
6   2800           0      0
7   3300           0      0
8   3600           0      0
9   2600           1      0
10  2900           1      0
11  3100           1      0
12  3600           1      0

In [14]:
y=final.price
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [16]:
model.fit(x,y)

LinearRegression()

In [18]:
model.predict([[2800,0,1]])

C:\Users\Azrin\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([565089.22812299])

In [19]:
model.predict([[3500,0,0]])

C:\Users\Azrin\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but LinearRegression was fitted with feature names
  warnings.warn(

array([693931.41259943])

In [20]:
model.score(x,y)

0.9573929037221871

In [21]:
from sklearn.preprocessing import LabelEncoder
LE=LabelEncoder()

In [23]:
dfLE = df
dfLE.town=LE.fit_transform(dfLE.town)
dfLE

    town  area   price
0      1  2600  550000
1      1  3000  565000
2      1  3200  610000
3      1  3600  680000
4      1  4000  725000
5      2  2600  585000
6      2  2800  615000
7      2  3300  650000
8      2  3600  710000
9      0  2600  575000
10     0  2900  600000
11     0  3100  620000
12     0  3600  695000

In [89]:
x=dfLE[['town','area']].values
x

array([[   1, 2600],
       [   1, 3000],
       [   1, 3200],
       [   1, 3600],
       [   1, 4000],
       [   2, 2600],
       [   2, 2800],
       [   2, 3300],
       [   2, 3600],
       [   0, 2600],
       [   0, 2900],
       [   0, 3100],
       [   0, 3600]], dtype=int64)

In [90]:
y=dfLE.price
y

0     550000
1     565000
2     610000
3     680000
4     725000
5     585000
6     615000
7     650000
8     710000
9     575000
10    600000
11    620000
12    695000
Name: price, dtype: int64

In [103]:
from sklearn.preprocessing import OneHotEncoder
onehotencoder = OneHotEncoder(categorical_features=[0])

TypeError: __init__() got an unexpected keyword argument 'categorical_feature'

In [92]:
x=onehotencoder.fit_transform(x).toarray()
x

array([[0., 1., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [0., 0., 1., 1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [1., 0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0.]])

In [93]:
x=x[:,1:]
x

array([[1., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0., 1., 0., 0., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0., 0., 1., 0., 0., 0.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [1., 0., 0., 0., 0., 0., 0., 0., 0., 0., 1.],
       [0., 1., 1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 1., 0., 0., 0., 0., 0., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 1., 0., 0.],
       [0., 1., 0., 0., 0., 0., 0., 0., 0., 1., 0.],
       [0., 0., 1., 0., 0., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 1., 0., 0., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 1., 0., 0., 0., 0.],
       [0., 0., 0., 0., 0., 0., 0., 0., 0., 1., 0.]])

In [94]:
model.fit(x,y)

LinearRegression()

In [95]:
model.predict([[1,0,2900]])

ValueError: X has 3 features, but LinearRegression is expecting 11 features as input.